{
    "modules": [
     {
      "module": "Multiplatform development",
      "outcomes": [
       {
        "outcome": "2.4.1.1",
        "type": "Agile",
        "descriptor": "Explain and compare project management environments, such as 'waterfall' methods, and be able to apply the underpinning philosophy and principles of Agile in a project situation even in a non-agile environment.",
        "explanation": "Make sure you EXPLAIN rather than DESCRIBE, which means you need to identify why these program managements are the way they are. Try and find other environments rather than just waterfall to compare against. Look for the original papers and manifestos of these. What you are trying to get to is not some woolly description but what is the essence of these methods and how they help deliver projects on time and on budget."
       },
       {
        "outcome": "2.4.1.2",
        "type": "Business",
        "descriptor": "Assess, in a team context, basic business behaviour, ethics and courtesies, demonstrating timeliness and focus when faced with distractions and the ability to complete tasks to a deadline with high quality.",
        "explanation": "What are the business behaviours, ethics and courtesies you would expect to find in a team context? How are you going to show how you are being timely and focused - its very difficult to take your seriously if you say you are being timely and focused and you have not done anything for an entire week! To write about this authentically you need to engage with the course which will help you have experiences you can assess. What were the distrations? What did you do to mitigate them? What academic sources can you find on effect team work and avoiding distractions?"
       },
       {
        "outcome": "2.4.1.3",
        "type": "Employability",
        "descriptor": "Make concise, engaging and well-structured verbal presentations and explanations of varying lengths, with and without the use of media, always taking into account the audience viewpoint.",
        "explanation": "Do get this learning outcome you need to actually do a presentation! Don't forget to record it. Staff will not organise this for you, you are better off putting in a time and date that suits you. The topic of this is up to you, it could be about your project, about something you found interesting in the news and did some research into, a programming technique - whatever. You don't have to just do 1. We would suggest doing one a semester at least so you gain confidence. They do not have to be long - 10 minutes max is perfect with 5 minutes for Q&A."
       },
       {
        "outcome": "2.4.1.4",
        "type": "Security",
        "descriptor": "Correctly apply the organisation’s security architecture to any particular systems or solutions development activities, and rewrite a simple program to remove common vulnerabilities, such as buffer overflows, integer overflows, and race conditions.",
        "explanation": "You need to have simple program with a vulnerability. Then rewrite it with the flaw fixed. This is two pieces of evidence. You can pick which vulnerability you wish to provide. Using a service like HackTheBox makes this trivial. You can also do the first part using some of their scenarios. You should also relate what you have learned to your own projects and work."
       },
       {
        "outcome": "2.4.1.5",
        "type": "Technical",
        "descriptor": "Create appropriate implementations for a selection of different contexts for HCI (mobile devices, consumer devices, business applications, web, business applications, collaboration systems, games, etc.) and be able to produce a user-centred design that explicitly recognises the user and is DDA compliant (Disability Discrimination Act).",
        "explanation": "Make sure you have screenshots of your project! Make sure you create a small app across multiple devices. There are many frameworks that allow this to be done quickly. You do need to say WHY it complies with standards such as DDA. This can be done as part of a larger project or a little mvp that is up to you."
       }
      ]
     },
     {
      "module": "Software services",
      "outcomes": [
       {
        "outcome": "2.4.2.1",
        "type": "Agile",
        "descriptor": "Explain agile project delivery and show how it applies to the roll out of a software project, ensuring an accurate and timely deployment in a customer friendly way, consistent with the customer needs.",
        "explanation": "You should have some notes already on agile project delivery from first year. Build on those to answer the first part. Then relate those notes to your projects. You should be looking to do some sort of continuous deployment which meets the needs of an audience. If its a fictional audience you have to justify your deployment strategy - easily done by comparing how you are doing it to other companies with real products. Ensure you reference your sources."
       },
       {
        "outcome": "2.4.2.2",
        "type": "Business",
        "descriptor": "Compare, from a client-side perspective, threat, risk and vulnerability, and analyse typical threats, attacks and exploits.",
        "explanation": "The client is the customer - you have to COMPARE which means you need positives and negatives across difference threats, attacks and exploits. This should be backed up by notes where you have investigated Cybersecurity content. There are many on HackTheBox and LinkedIn Learning. Make sure you then relate this theory to your own work and how clients might use your product."
       },
       {
        "outcome": "2.4.2.3",
        "type": "Employability",
        "descriptor": "Be creative, self-motivated, self-aware and able to reflect on successes and failures in ways that strengthen positive attitude and develop self-reliance through an understanding of their own personal preferences, styles, strengths and weaknesses.",
        "explanation": "Basically write good reflections. Use the Edinburgh Reflection Toolkit as a guide - don't try and make up your own format. The first ones will be HARD. Get feedback regularly from staff - and that means daily to weekly, not never!"
       },
       {
        "outcome": "2.4.2.4",
        "type": "Security",
        "descriptor": "Appraise and manage risk for threats and vulnerabilities to information systems on an ongoing basis.",
        "explanation": "Appraise = review and identify, manage = take account of, mitigate, have a plan for. Ongoing basis = on a regular basis through the lifetime of the project. Information systems = your projects. You should be doing this as part of your DevSecOps day to day development."
       },
       {
        "outcome": "2.4.2.5",
        "type": "Technical",
        "descriptor": "Explain and apply concepts such as loose coupling, separation of concerns, gang of four, multi-tiered architectures.",
        "explanation": "Do the research - there are LinkedIn Learning videos that cover these in lots of detail. Find books online with chapters you can read on these. Write notes. Write some code the exemplifies these - Java is a good language for that as its OOP by nature, but you can use any C style language. You should also then reflect how knowing about these things makes your code better/worse and your system design better/worse! You could also review an open source software package for these patterns and say how they make the code easier/worse to read/understand."
       }
      ]
     },
     {
      "module": "Software architecture",
      "outcomes": [
       {
        "outcome": "2.5.1.1",
        "type": "Agile",
        "descriptor": "Analyse a range of digital development activities and estimate the costs and effort for allocating and managing appropriate phased contingency.",
        "explanation": "For each project you do you need to carry out activities that will allow your team to estimate costs and effort. You can do this as a team or individually but you should document your activity and make sure that each of you can explain what did. You need to explain what phased contingency is? What it means to allocate resources? What it means to manage resources? You will want to say if how you went about it was valid i.e. did you follow a process? If you were not, why not? Find resources you can use to help you."
       },
       {
        "outcome": "2.5.1.2",
        "type": "Business",
        "descriptor": "Compare, from a service providers perspective, threat, risk and vulnerability, and analyse typical threats, attacks and exploits.",
        "explanation": "This is the opposite side of LO2.4.2.2 so do the same thing but from a service providers perspective. You might want to define your terms here as well. Notice you have to COMPARE not DESCRIBE."
       },
       {
        "outcome": "2.5.1.3",
        "type": "Employability",
        "descriptor": "Apply analytical and critical thinking skills to Technology Solutions development and to systematically analyse and apply structured problem-solving techniques to them.",
        "explanation": "So this is basically your Design Thinking - not the Hopes and Fears but those tools that help you break down the problem into steps and priorities. This can also cover breaking a problem into classes/functions. You want to tag evidence of code or pdfs and reflect on the techniques you used by researching various problem solving techniques and processes for systematically breaking down problems."
       },
       {
        "outcome": "2.5.1.4",
        "type": "Security",
        "descriptor": "Describe the types of testing that are commonly applied to identify vulnerabilities in software and show how to make software more resilient to threats.",
        "explanation": "First part should be easy given a good course from LinkedIn Learning and some reading. The second half though requires you to SHOW that means maybe some hackthebox examples or some of your own showing before and after the vulnerability has been removed. This can be done in combination with LOLO2.4.1.4."
       },
       {
        "outcome": "2.5.1.5",
        "type": "Technical",
        "descriptor": "Examine the fundamental components of technology solutions in a range of typical modern business environments, explain their interactions for any applicable target system (e.g. games console, smart-phone, embedded system) and compare the benefits and the differences of these environments.",
        "explanation": "What are the fundamental components from your research? How do they affect installation on different platforms? e.g. would you run a database on a PS2 or might you create a REST API for the PS2 to communicate with your servers? COMPARE the good aspects and the bad aspects of both. Make sure you then refer to how you will use this knowledge in current/future projects. Make sure you reference relevant books, videos and tutorials you have used."
       }
      ]
     },
     {
      "module": "Software Quality Assurance",
      "outcomes": [
       {
        "outcome": "2.5.2.1",
        "type": "Agile",
        "descriptor": "Analyse the importance for the need to identify and manage project deliverables, identifying benefits for development and customer.",
        "explanation": "You need to analyse, not just say its important! Why is it important, cite some case studies, cite some projects where it has gone wrong and why. Are there common reasons for projects to fail? If so what are they?"
       },
       {
        "outcome": "2.5.2.2",
        "type": "Business",
        "descriptor": "Compare and contrast different industry standard software development processes, including distributed work (e.g. onshore, near shore and offshore), and identify the key enablers to make each model successful.",
        "explanation": "What do the different industry standard terms mean? Where are they used? Where do they crop up in the news? Why do companies use these different processes? What makes them successful or not? Find academic work that looks into their success. If writing or illustrating cite your sources with the text and give references. You might also think if you had a business in the Highlands or where you live, what method would work for you do you think and why?\nTIP:Whenever you have what looks like a dry and boring learning outcome - try and place it in a context where it could matter to you. That might allow you access motivation and grab your attention."
       },
       {
        "outcome": "2.5.2.3",
        "type": "Employability",
        "descriptor": "Examine the use of performance evaluation tools in a business context, and justify how his/her own work is providing value to the team.",
        "explanation": "Again research different performance evaluation tools - you have to examine them, so what are they, how do they work, what are the pros and cons. Then justify using them in your team to see if they add value. One day you might be evaluated using these for real, so now might be a good time to work out how they work and how you can use them to your advantage."
       },
       {
        "outcome": "2.5.2.4",
        "type": "Security",
        "descriptor": "Implement robust, scalable and future-proof software security solutions that meet specific and generic requirements, and internal/external security standards and best practice.",
        "explanation": "Again this involves researching and noting what the solutions are, when they are used and why. What are the standards and best practices? Where can you add them into your own work? Do you need a separate project, a small mvp or something other method to demonstrate you can implement them?"
       },
       {
        "outcome": "2.5.2.5",
        "type": "Technical",
        "descriptor": "Compare and contrast the different types and levels of verification (analysis, demonstration, test, formal proof, inspection etc.) and testing (unit, integration, systems, and acceptance) including the role and value of test driven development techniques.",
        "explanation": "Again you have to research these different techniques. Find a good overview video on LinkedIn Learning by searching for keywords. Takes notes then dig down into more focused literature so you can compare and contrast. Try and do small implementations and then hopefully you will have time to work these into your larger team projects."
       }
      ]
     },
     {
      "module": "Data transformation",
      "outcomes": [
       {
        "outcome": "2.6.1.1",
        "type": "Agile",
        "descriptor": "Apply industry standard process, methods, techniques and tools to execute projects.",
        "explanation": "This should be self-explanatory. The way we pick up on this is through your reflections of using these processes, method, techniques and tools. We would expect to find notes and courses you have completed that teach you about these things. If we don't see any of these and just see some files produced by automated frameworks then that does not comply with this learning outcome."
       },
       {
        "outcome": "2.6.1.2",
        "type": "Business",
        "descriptor": "Differentiate between features and benefits, giving appropriate examples, and show how to use these effectively in a marketing campaign",
        "explanation": "What is a feature? What is a benefit? Can you give examples of these from your daily life, does not have to be technology. You should try and apply these to your own project though as well. How should these be used to convey your marketing message to your customers/audience? Find business/marketing research on these to back up your points - there is lots out there!"
       },
       {
        "outcome": "2.6.1.3",
        "type": "Employability",
        "descriptor": "Explain what is active listening. Demonstrate how active listening can be applied in appreciating others view and contributions.",
        "explanation": "You need to look up academic work on active listening - what is it, why is it useful? why is it different from just listening? You then need to say how you are using the technique to improve your own communication. If you wanted to do an experiment you could roleplay with a peer not doing active listening but doing the opposite and get the recipient to do the same and then compare and contrast what you pick up as the differences."
       },
       {
        "outcome": "2.6.1.4",
        "type": "Security",
        "descriptor": "Examine the technical aspects of information security including client data protection and the data protection act.",
        "explanation": "You need to do more than just describe the data protection act and/or GDPR, you need to go deeper and think WHY it is set up the way it is. Note that this is about the TECHNICAL aspects, the HUMAN aspects are covered by another learning outcone. Maybe find some examples from before the DPA/GDPR came into force. You don't need to go into all of it but you should try and pick out some important aspects of it. You should also look for academic critiques of it so you can familiarise yourself with the tradeoffs made."
       },
       {
        "outcome": "2.6.1.5",
        "type": "Technical",
        "descriptor": "Explain the role of data mining and the algorithms developed to address different data mining goals, and relate the application of these algorithms to real-world problems including big data.",
        "explanation": "This says what it is really. We would expect to find a few completed courses with exercises on big data, data mining and associated algorithms. You should know the difference for example between supervised, unsupervised and reinforcement learning. You should know what clustering is and PCA. You should be able to explain how these relate to real world business challenges and your own projects."
       }
      ]
     },
     {
      "module": "Data as a service",
      "outcomes": [
       {
        "outcome": "2.6.2.1",
        "type": "Agile",
        "descriptor": "Evaluate the quality assurance processes that can be automated during software development to achieve and maintain project requirements.",
        "explanation": "What are QA processes? Where do you find them? How are they automated? In order to evaluate them you need to be able to set them up - you can do this in Bitbucket or IBM Cloud. You need to use them to maintain your software quality. We would expect to see some evidence of research, evidence of linkedin learning courses taken and attempts at implementations - even if they don't work - say so and say what might be going wrong! Failure is always on the path to success so its important we see that so we can credit you for trying!"
       },
       {
        "outcome": "2.6.2.2",
        "type": "Business",
        "descriptor": "Examine human aspects of information security including client data protection, GDPR and the data protection act.",
        "explanation": "Similar to LO2.6.1.4. This covers the HUMAN aspects of it though not the TECHNICAL aspects."
       },
       {
        "outcome": "2.6.2.3",
        "type": "Employability",
        "descriptor": "With guidance, conduct research, using common industry literature and other media, into IT and business-related topics.",
        "explanation": "You should be following the technology news by now. You can use academic and industry sources to explore current issues such as cybercrime or ethical issues. Its your choice. You can do this alone or as a group. Make sure you cite and reference all sources and remember it does not have to be a written piece, it could be illustration or a mindmap style collage. Be creative. This could be a great one to present to the class!"
       },
       {
        "outcome": "2.6.2.4",
        "type": "Security",
        "descriptor": "Analyse the common pitfalls and mitigations of common security approaches.",
        "explanation": "As the learning outcome says. Make sure you don't just describe, analysing them says you go into why they happen, maybe look at whether they are becoming more or less common as a technique. Relate the pitfalls and mitigations to your own work if possible. This should tie in with the other security learning outcomes so there may be commonality in terms of the technical activity that you can refer to. You should be referring to relevant tutorials, LinkedIn Learning courses, news websites, subject matter websites, books etc. Remember to cite and reference any materials you do use."
       },
       {
        "outcome": "2.6.2.5",
        "type": "Technical",
        "descriptor": "Implement a data driven website, explaining the relevant technologies involved in each tier of the architecture and the accompanying performance trade-offs.",
        "explanation": "This can be done as a main project or a smaller side project. You need to explain why you are using the technologies, what they are, what they are used for, how prevalent are they, where do they fit in the technology stack, is it an unusual combination you are using or not. What are the tradeoffs? This means identifying other ways to do the same thing. You might need to build those alternatives to compare them them. Ensure you justify decisions using sources that you cite and reference.\nIf you are working in industry you can still build a small data driven website, or you can talk to delivery staff to see if you are doing anything that might fall into this category e.g. making Tableau dashboards."
       }
      ]
     }
    ]
   }